namespace DMS
{
    internal class idea
    {
        /*Мисля да остана с идеята за Data pages и ще вкарам IAM(Index Allocation Map)
        За всяка таблица ще имам един(в повечето случаи) файл който ще има логическите адреси(няма да ползвам физически адреси) към моите data pages за дадената таблица
        Всеки data page ще е 8KB и когато има overflow ще правя buffer с 24 байта който ще е просто логически адрес към следващия data page
        Ще си направя и metadata за всяка таблица която ще има инфо как ще изглежда таблицата и какви релации ще има

        За менажиране на всичко това ще използвам B+Tree не BTree*/
    }
}
